[
  {
    "date": "November 13, 2019",
    "role": "Chief Information Officer (CIO), Executive Vice President (EVP)",
    "comments": "Terrific work on Project 42 - I loved seeing the progress you've made. This will have a huge impact on how we work and I so appreciate all your hard work. Keep it up - you are making us all better."
  },
  {
    "date": "Feb 5, 2021",
    "role": "Vice President (VP) Corporate Technology",
    "comments": "I wanted to let you know that I was on a call for a Runway demo and discussion and was very impressed with  Karl. He has a great understanding of the platform and the technology of course, but his patience, and willingness to engage and even debate in a very productive and respectful manner was impressive."
  },
  {
    "date": "March 5, 2021",
    "role": "Director, Architecture Technology Fellow",
    "comments": "You continue to be a great asset and leader in the Dev Exp place, especially as the product line is growing. I'm really enjoying the partnership with you as PTL and me as PO. With each iteration, I feel like we're gaining momentum, velocity, and a better view of the horizon.Thank you for all the #passion, #accountability, and #selfless behavior - from planning activities, engagement with new squad engineers, and making yourself available to all of our customers.Thank you!"
  },
  {
    "date": "September 10, 2020",
    "role": "Sr. IT DevOps Automation Manager",
    "comments": "SELFLESS: Karl has been helping multiple infrastructure teams in their automation and self service journey. He provides training, shares his knowledge to boost the teams to get started on development with Runway. This is on top of his own development commitment. But he never push the other teams away when they need him."
  },
  {
    "date": "March 1, 2021",
    "role": "IT Data Warehousing Manager",
    "comments": "Karl, I just want to thank you for all you do to enable the DEA group move forward on our automation efforts. You are a great technical leader, so patient, and such a good mentor to my team. I'm glad to have you on our squad! #selfless #passionate"
  },
  {
    "date": "July 19, 2019",
    "role": "Vice President (VP) Enterprise Technology Services",
    "comments": "Karl, Great automation demo this week, you rock!"
  },
  {
    "date": "March 8, 2021",
    "role": "Sr Consultant",
    "comments": "Karl, Thank you for coming in to Tech Board last month to walk us all through Runway. I know you have a lot on your plate right now, so I want to make sure that you know that you are appreciated. Keep being awesome!"
  },
  {
    "date": "December 4, 2020",
    "role": "Sr Consultant",
    "comments": "Thanks for everything that you do for the team and for all of AA. I am very glad that I had a chance to work with you this year!"
  },
  {
    "date": "December 11, 2020",
    "role": "Developer, IT Applications",
    "comments": "#passionate Thank you for constant eye on bugs and finding practical solutions. Not to mention all the times you've helped debug vra, scaffold, etc. #selfless Thanks for providing community contributors guidance and 1on1 help when needed. This more than anything is what will make Runway Successful."
  },
  {
    "date": "December 11, 2020",
    "role": "Associate Developer, IT Applications",
    "comments": "Karl, thanks for all your help with the Data Lake Review Page effort over the past few months! You've been great at understanding what my team needs and advising me on how to design new features on Runway. You know the architecture of the Runway system very well. Also, I really appreciate that you are readily available to help me with technical issues when I try to finalize code (e.g. test cases not working, Git problems). I look forward to continuing to work with you on functional access."
  },
  {
    "date": "March 2, 2021",
    "role": "Associate Developer, IT Applications",
    "comments": "Karl, I appreciate all your help with the Azure service principal access over the past several weeks! The API calls, especially, were very difficult to write and debug--thanks for guiding me through that."
  },
  {
    "date": "December 22, 2020",
    "role": "Sr. Engineer, IT Middleware",
    "comments": "#passionate #caring Thank you for the support you provide and answering our questions without any delay when ever we need. Highly appreciate for helping us (ITCE team) in setting up the apigee implementation in Runway"
  },
  {
    "date": "December 21, 2020",
    "role": "Sr. IT DevOps Automation Manager",
    "comments": "First of all, thank you for stepping up and take the responsibility to lead the Runways squads. I was expecting you to catch up gradually since you are relatively new to software development, and the amount of work and number of teams involved in Runway is enormous. You know what, I didn’t even notice the transition. Two weeks later, I'm looking at a more organized and clean project space and more effective scum meetings. It's not just me, I also heard great feedback from your teammates that they feel their heads are more clear now. #accountable Wonderful job Karl! keep it up."
  },
  {
    "date": "July 31, 2020",
    "role": "Network Architect Manager",
    "comments": "I attended the Interact Studio today and the 'Now' Project 42 team presented yielding amazing comments from the audience. I have a belief one of the key items I have learned about amazing leaders...it’s not necessarily what they did when they were there. The true testament of a leader is if the leaders principles live on for others to progress when the leader moves on. Great work my friend, 42 Thrives."
  },
  {
    "date": "December, 2017",
    "role": "Network Services Manager",
    "comments": "Karl is an exceptional engineer! He is reliable, delivers quality work on time and takes on any challenge presented. He is dedicated and hard working and has become quite a star among the team! His peers look to him for support and guidance in his areas of expertise. Karl lead the Tools team to success by ensuring the Roadmap was completed and reviewed at a regular cadence. Thank you for all you do Karl!"
  },
  {
    "date": "January, 2019",
    "role": "Network Services Manager",
    "comments": "Karl is passionate about what he does and how he does it. His collaborative approach and desire to work with others will enable IT to push together as ONE team. As we continue to move to an Agile and Devops organization, Karl has been a leader to help sharpen our multi-discipline areas such as knocking down roadblocks for the teams. Karls's passion for “team” is awesome and balancing it in communications with other departments will help drive excellence for us in  2019 across other orgs. Additionally, his caring personality, putting the needs of others first and regard for the each person is very apparent and an awesome strength. Overall, Karl has great momentum and I am looking forward to a productive 2019."
  },
  {
    "date": "January, 2019",
    "role": "Network Architect Manager",
    "comments": "Karl consistently keeps ahead of the curve of developing technologies for his area of expertise, often leading others to solve security related issues with development tools."
  },
  {
    "date": "June 20, 2017",
    "role": "Network Engineering Manager",
    "comments": "Working as a team for the H3C insourcing your automation solutions for migrating switches from HP(DXC) Managed to AA Managed has enabled the Network Engineering team to achieve the result of migrating 100 switches or more in a change. This type of automation never existed before, thank you for your long days and nights to enable this automation solution for the Airline."
  },
  {
    "date": "December, 2017",
    "role": "Network Services Manager",
    "comments": "Karl has great scripting skills and leverages them to streamline work when applicable. As AA IT continues to drive toward more automation, Karl is the key resource on the Services team to assist in that growth."
  },
  {
    "date": "January, 2019",
    "role": "Network Architect Manager",
    "comments": "Karl's demeanor is one of operational excellence.  Karl regularly solicits feedback from peers on improvements and implements."
  },
  {
    "date": "August 4, 2019",
    "role": "Network Security Manager",
    "comments": "Thank you for taking the time to talk to me about your automation journey and how our teams can collaborate to integrate our tools. Thanks for all you do."
  },
  {
    "date": "August 15, 2018",
    "role": "Network Services Architect",
    "comments": "Karl took it upon himself to develop a platform that would automate common tasks to correctly insource and monitor systems. These task were very time consuming on engineers and administrators. This was not an easy task since there were 5 separate and very different platforms that he needed to code for based on their API capabilities. This new platform will free up several man hours per request and allow adminstrators and engineers to concentrate on more pressing work."
  },
  {
    "date": "March 31, 2020",
    "role": "Sr IT Project Manager",
    "comments": "Hi Karl, Always been a fan of yours thinking outside the box! Project42 needs young, energetic and intelligent ones like you! Thanks for working in collaboration with our LCM team and others."
  },
  {
    "date": "March 26, 2020",
    "role": "Network Services Team Lead",
    "comments": "Karl - On behalf of the entire LCM team we would like to thank you for working so diligently on the information we requested. You put a lot of time and effort into this and we all appreciate it more than you know!! Your team work and dedication to collaboration is to be commended. Thank you again!!"
  },
  {
    "date": "September 30, 2020",
    "role": "Network Security Engineer",
    "comments": "Thanks Karl your work on Project 42 is awesome and that is gonna help us to reduce lot of manual work."
  },
  {
    "date": "August 20, 2018",
    "role": "Network Tools Engineer",
    "comments": "Karl is a colleague that every one can dream of to work with. He is one of the few on whom we can rely on anytime, any situation. The best back up I ever got in my experience. He always makes me proud when I come back from vacation by keeping up with work. I can plan my vacations without hesitation and less worried, just because of him. He has added a great deal of automation to our tools which has reduced the daily work load of the entire team. Which in turns helps to reduce manual errors and be more reliable. Thank you Karl!!"
  },
  {
    "date": "March 10, 2020",
    "role": "Network Tools Engineer",
    "comments": "Thank you Karl for assisting with all the Network Tools questions recently. You are a very reliable team mate who is always open to help others. Appreciate your patience and all the help. :)"
  },
  {
    "date": "March 5, 2020",
    "role": "Application Developer",
    "comments": "From the day I started working at AA Karl has been very instrumental in collaborating with me. He thrive on finding better ways to do things and is always available for assistance. he has made my integration at AA very smooth and I would like to take this chance to say thank you and look forward to a continuous collaboration and innovation."
  },
  {
    "date": "June 7, 2018",
    "role": "Sr Network Engineer",
    "comments": "Thank you for consistently bringing value to the company, being open-minded to new ideas, and for all you do to maintain the integrity of the tools."
  },
  {
    "date": "June 1, 2018",
    "role": "Network Tools Engineer",
    "comments": "Thanks for the hard work done on the new ENS portal tool. Its laying the foundation to lots of great tools to come. "
  },
  {
    "date": "April 4, 2018",
    "role": "Sr Datacenter Network Engineer",
    "comments": "Just wanted to say thanks for helping out with troubleshooting some major issues in the DataCenter and taking the time to get me the tools I needed. True team work mentality."
  },
  {
    "date": "November 28, 2017",
    "role": "Network Engineering Team Lead",
    "comments": "Thank you Karl for being the professional engineer that you are. I cannot count the number of times you have stopped what you were doing to assist network engineering with showing how to use a specific tools or recommending solutions to problems. You are an example to us all Karl. We look forward to hearing all the great things you will accomplish in the future."
  }
]
