[
  {
    "date": "Sept 30, 2022",
    "role": "Principal Product Owner, IT",
    "comments": "Thank you for your #passion around Runway and how you are always willing to help our customers and the developers on our team. #selfless"
  },
  {
    "date": "Sept 30, 2022",
    "role": "Developer, IT Applications",
    "comments": "Thank you for all of your work on Runway. I feel like you have really helped move the needle on improving the developer's experience at AA. I find your commitment to improving the status quo to be inspiring. Thank you."
  },
  {
    "date": "Sept 30, 2022",
    "role": "Sr Developer, IT Applications",
    "comments": "Thank you for all the mentoring that you do! #passionate #selfless #accountable"
  },
  {
    "date": "Sept 30, 2022",
    "role": "Sr Engineer,  IT Network",
    "comments": "Thanks Karl for always being there when I need a hand, with lightning reflexes on the response and precise exact anwers. Thanks Again!!!"
  },
  {
    "date": "Sept 30, 2022",
    "role": "Principal Programmer/Technical Lead, IT Applications",
    "comments": "Appreciate all the help in designing kubernetes cluster migration/upgrade strategy."
  },
  {
    "date": "Sept 30, 2022",
    "role": "Principal Programmer/Technical Lead, IT Applications",
    "comments": "I honestly don't know where runway would be without your expertise. Coming into the team has been very easy with the stable foundation that you created. Also thank you for helping enable me to support our team and customers in my new role! #passionate #selfless #accountable"
  },
  {
    "date": "Sept 19, 2022",
    "role": "Principal Data Architect, IT",
    "comments": "Thanks for helping us out with the FastAPI repository modifications for CICD workflow for Orion team. Your knowledge and willingness to help is really valuable. #selfless"
  },
  {
    "date": "Sept 6, 2022",
    "role": "Sr Manager, IT DevOps Automation",
    "comments": "Thank you for taking time to be part of the diverse hiring panel for the KaaS PTL position. You didn't just bring your technical expertise to the table, you take the lead to prepare interview questions and is always one step ahead of the game. We will not be able to hire the right talent for TnT's need without your #selfless and #accountable contribution. I appreciate you."
  },
  {
    "date": "Aug 26, 2022",
    "role": "Sr Engineer, IT Applications",
    "comments": "Appreciate the help in troubleshooting pingfed Kubernetes oauth2 integration. #selfless #passionate"
  },
  {
    "date": "Aug 23, 2022",
    "role": "Sr Developer, IT Applications",
    "comments": "Thanks for helping during office hours like you always do. #selfless #accountability"
  },
  {
    "date": "Aug 23, 2022",
    "role": "Sr Developer, IT Applications",
    "comments": "Thanks for being open to receiving help for the gitops video. Also, it was very #selfless of you to do the video, and to allow me to participate showed your ability to include others #i-dei"
  },
  {
    "date": "Jun 28, 2022",
    "role": "Principal Programmer/Technical Lead",
    "comments": "Your passion to doing things right the first time is spreading across the team and sets up a perfect way to deliver quality results. #Passionate Thank you for making yourself available everytime to all team members to ask any questions they may have and to share your knowledge/learnings. One thing that stood out from all your meetings (internal / office hours) with team members is how you keep them comfortable by reiterating many a times to feel free to ask any questions (even if they have asked it previously). #Selfless"
  },
  {
    "date": "Jun 21, 2022",
    "role": "Technical Delivery Manager",
    "comments": "Your #selfless contributions towards building a better team, goes to show your #accountability, and the #passion that you have not just for your job but for your team.Thank you."
  },
  {
    "date": "Jun 21, 2022",
    "role": "Technical Delivery Manager",
    "comments": "Thank you for all your preparations and hard work to allow ACE and Agent Assist to be the first applications to run in the production Runway shared cluster. The level of engagement and response time supporting our evolving needs exceeded everyone expectations. Without this level of support and willingness to adapt, the cutover would not have been possible. Partnering with you reduced the commitment by ACE resources to develop/support infrastructure and allowed us to redirect additional capacity towards business value."
  },
  {
    "date": "June 4, 2022",
    "role": "Senior Manager, Technology Transformation",
    "comments": "Thanks for your support in TnT Automation War III. The event would not have been so successful without your expertise and your #selfless contribution."
  },
  {
    "date": "Apr 28, 2022",
    "role": "Sr Principal Architect, Technology Transformation",
    "comments": "Thank you for going above and beyond and remediating all of your storage account, function app, and app services compliance issues. I also want to share my appreciation for you being willing to speak up and give solutions when you see things that can be improved. We do need to improve our product management lifecycle so that folks that 'own' resources/assets know that they are responsible. #passionate #accountable"
  },
  {
    "date": "Mar 31, 2022",
    "role": "Manager, IT Systems Engineering",
    "comments": "It is not much - but I do want to say thank you for everything you do to help me through the day to day operations."
  },
  {
    "date": "Mar 31, 2022",
    "role": "Sr Manager, IT Middleware Engineering",
    "comments": "Thank you Karl for everything you do! I appreciate your #accountability and #passion in making yours and Tim's ( and Jason's) vision for Runway a reality.With the right support and customer focus, I am looking forward to continued adoption and growth for Runway."
  },
  {
    "date": "Mar 31, 2022",
    "role": "Sr Engineer, IT Systems",
    "comments": "Thanks for always inspiring us and setting the Bar so high. You are a true Inspiration and keep us supporting all the time. ## Passionate ###Accountable."
  },
  {
    "date": "Mar 31, 2022",
    "role": "Technical Lead, IT Applications",
    "comments": "Thanks Karl. You've helped too much to itemize. Just thanks."
  },
  {
    "date": "Mar 31, 2022",
    "role": "Sr Engineer, IT DevOps",
    "comments": "Karl, thanks for your support and help on Runway.. you continue to support our plugins and keeping them up to date. I can always depend on you because you are #accountable and #passionate."
  },
  {
    "date": "Mar 11, 2022",
    "role": "Associate Engineer, IT Systems",
    "comments": "Karl,Thank you for always being willing to help and being so diligent with solutions. The work you do technically and interpersonally really contributes to the feeling of being in a well functioning team."
  },
  {
    "date": "Mar 4, 2022",
    "role": "Sr Engineer, IT Quality Assurance",
    "comments": "Thank you for your continued support and knowledge transfer on different technologies. My transition into the new role was seamless because of people like you. Thanks you so much for all your help."
  },
  {
    "date": "Dec 31, 2021",
    "role": "Sr Principal Architect, IT Applications",
    "comments": "Karl - I truly appreciate all the hard work youve done for all of CEP and especially in pushing Runway to where it is today, we couldn't have done it without it. You're the example of #passion! Thank you!"
  },
  {
    "date": "Oct 26, 2021",
    "role": "Associate Developer, IT Applications ADEPT",
    "comments": "Hey Karl, Thanks for your eagerness to transfer knowledge and insight about the Runway product and its technologies; glad to have you as an authority on the product, especially with your diagramming and visual aids!"
  },
  {
    "date": "Oct 19, 2021",
    "role": "Sr Architect, IT Security Assurance",
    "comments": "Good job on integrating Runway with MFA.Good security practice."
  },
  {
    "date": "Oct 5, 2021",
    "role": "Manager, IT DevOps Engineering",
    "comments": "Karl, thank you for doing a great job in DelEx and always be available to answer my many questions and frequent interruptions to your day."
  },
  {
    "date": "Oct 4, 2021",
    "role": "Managing Director, Technology Transformation",
    "comments": "Karl - You rock!!! I'm so happy we have you on the team leading the way for Runway!!!"
  },
  {
    "date": "Sept 30, 2021",
    "role": "Director - Technology Transformation, Architecture Technology Fellow",
    "comments": "The last quarter has included a ton of above and beyond work across multiple domains. The outcomes include automation that is viable for many teams and referenced in multiple conversations. There's also the clear direction of approaches and patterns to application development, testing, and deployment to the cloud that is making it easy for teams to do the right, hard things.You continue to demonstrate a great balance of customer needs & experience with making sure American data & applications are safe and secure.#passionate #accountable #selfless"
  },
  {
    "date": "Sept 30, 2021",
    "role": "Sr Manager, IT DevOps Automation",
    "comments": "Karl,Thank you for taking the ownership designed and implemented one of the most needed solution that easily create and config Kubernetes clusters. You dedicated effort in the last 4 months has paved the road for others. The automated infrastructure as code solution through runway shorten the effort from months to less than 30 minutes. In addition, the automated solution ensured consistency that will make support and maintenance easier. Thanks for your great work that demonstrated #passionate #selfless #accountable."
  },
  {
    "date": "Sept 30, 2021",
    "role": "Associate Developer, IT Applications",
    "comments": "Thank you for always taking the time to collaborate, explain concepts, answer questions, walk us through examples, and for everything else you have done to help us with this ACE initiative. We really wouldn't have made this much progress without your help. It is really appreciated #selfless"
  },
  {
    "date": "Sept 30, 2021",
    "role": "Principal Product Owner, IT",
    "comments": "Thank you so much for all of your efforts this quarter delivering a truly amazing developer experience platform. I believe many will look back on your work as the start of something special and the catalyst to making delivery transformation possible for every team at American Airlines. #selfless #accountable #passion"
  },
  {
    "date": "Sept 30, 2021",
    "role": "Sr Engineer, IT SOA Middleware",
    "comments": "Thanks for being a great leader and for always being there to for sharing your wealth of knowledge to the team so that we can grow and achieve our goals. #Passionate #Accountable #Selfless"
  },
  {
    "date": "Sept 29, 2021",
    "role": "Sr Engineer, IT Systems",
    "comments": "Your continued support is the one thing I can always count on. You showed me patience, guided and motivated me whenever the situation arose. Thanks for supporting me wholeheartedly."
  },
  {
    "date": "Sept 27, 2021",
    "role": "Sr Engineer, IT Quality Assurance",
    "comments": "Thanks for all your contributions to the DevEx. You have been awesome when it comes to solving issues and provide knowledge transfer/help when needed. Really appreciate it."
  },
  {
    "date": "Sept 23, 2021",
    "role": "Principal Architect, IT Applications",
    "comments": "Thank you for all your support for our team with runway. We literally could not do this without your help and we are so happy that this is going to provide a lot of value not only for our product team, but also for runway and AA as a whole. #passionate #selfless"
  },
  {
    "date": "August 31, 2021",
    "role": "Principal Consultant, IT Agile and DevOps",
    "comments": "Thank you for doing so much and investing so much of your time and passion towards improving the developer experience at American. Your efforts make the lives of many of us easier and push us as a company in the right direction. #passionate #selfless #accountable"
  },
  {
    "date": "July 2, 2021",
    "role": "Principal Data Architect, IT",
    "comments": "Karl has been a great help throughout this year for the DEA team #selfless. He has partnered, collaborated and guided us on many efforts on the Runway #passionate. More than his technical skills, it is his approachability and objective outlook that has helped many of us to share ideas, gain knowledge and do the best. He has been a great proponent of automation, and definitely a big asset to AA."
  },
  {
    "date": "July 2, 2021",
    "role": "Sr Manager, IT",
    "comments": "Thank you for leaning-in, embracing, owning and leading our teams on this journey. I appreciate all you do with #passion and #selfless focus"
  },
  {
    "date": "July 2, 2021",
    "role": "Sr Manager, IT",
    "comments": "Thank you for leaning-in, embracing, owning and leading our teams on this journey. I appreciate all you do with #passion and #selfless focus"
  },
  {
    "date": "July 1, 2021",
    "role": "Chief Information Officer (CIO), Executive Vice President (EVP)",
    "comments": "Just awesome.  I am so impressed with how you envisioned this future, quickly developed it, and flawlessly executed it by making it super easy for the product teams and holding their hands through the process. You all have moved our developer experience into the modern age!  Thanks and congratulations to the entire team."
  },
  {
    "date": "June 30, 2021",
    "role": "Director, Customer Technology Architecture",
    "comments": "Thank you for taking the time to come and present at CT-TechEx last month (twice!) and sharing all the great stuff happening in Runway and Tower!The sessions with TnT are always really well received and it's always terrific content.Thanks"
  },
  {
    "date": "June 30, 2021",
    "role": "Director - Technology Transformation, Architecture Technology Fellow",
    "comments": "You continue to drive great things within DevExp - for both the customer/developer experience as well as bringing out technology landscape to more modern engineering practices, delivery, and approach.Thank you!"
  },
  {
    "date": "June 30, 2021",
    "role": "Sr Principal Architect, IT Applications",
    "comments": "Karl, Thank you for being that to answer any and all questions on runway, tower and many TnT topics. Your willingness to help out with various questions is very valuable for TechOps Products and teams. Looking forward to continued collaboration in the runway front!"
  },
  {
    "date": "June 30, 2021",
    "role": "Sr Engineer, IT",
    "comments": "Thank you for all that you do to help DX be successful.And for always been open to answer questions and help without any judgment.#passion #accountable #selfless"
  },
  {
    "date": "June 28, 2021",
    "role": "Project Manager",
    "comments": "Karl-Thank you for always being willing to support your organization's growth and jump in to lead a workshop at a moment's notice! You're a true team player and it's extremely evident you seek to enrich everyone's knowledge level around you. We in Emerging Tech are incredibly appreciative of you!"
  },
  {
    "date": "June 25, 2021",
    "role": "Sr. Engineer",
    "comments": "Thank you for always helping me out when I have questions about Runway and helping us get our first few plugins out there! #passionate #selfless"
  },
  {
    "date": "June 25, 2021",
    "role": "Sr. Engineer",
    "comments": "Thanks for all your hard work and all the support for Data Movement Squad to guide TNT org and AA to success#selfless #passionate #accountable"
  },
  {
    "date": "June 25, 2021",
    "role": "Sr. Engineer",
    "comments": "Thanks to work with me on my automation stuff and make it so easy. Thank you to support me. #passionate #selfless #accountable"
  },
  {
    "date": "June 24, 2021",
    "role": "Sr. IT DevOps Automation Manager",
    "comments": "Thank you all for your support of TnT talent search. It's a time consuming process to find the right fit. From screening resume, planning the interview questions, coordinating with hiring manager, and juggling among your already busy day to day priorities to carry out the interviews. Each talent we bring onto the team, there is tremendous effort behind the scene. I really appreciate your #selfless contribution to the organization."
  },
  {
    "date": "May 5, 2021",
    "role": "Director - Technology Transformation, Architecture Technology Fellow",
    "comments": "More awesome-ness from you ... this week (and earlier), with all the workshops, the OK8 work, and driving features in Runway are all tremendously valuable to both our tech direction, our culture, and getting more foundational tech in place for renewed trust in travel.Thank you for all the contributions across so many areas!#selfless"
  },
  {
    "date": "May 3, 2021",
    "role": "Sr Consultant, IT Agile and DevOps",
    "comments": " #selfless Karl, I wanted to thank you for all you help last week with the 007's flash build. Without you stepping up, we could not have done the dual track mobbing approach and this gave the squad SO MUCH learning opportunity! Your thoughtful skill up training was so appreciated!!"
  },
  {
    "date": "April 19, 2021",
    "role": "Technical Delivery Manager",
    "comments": "I wanted to thank you for all the support you have provided the Phenoms squad. We are all appreciative of your willingness to coach and train the team."
  },
  {
    "date": "March 31, 2021",
    "role": "Principal Programmer, Technical Lead",
    "comments": "Karl, thank you for being an integral part of enabling Engineering Excellence to bring our tools into Runway. You went above and beyond to make sure that roadblocks were removed as we went through the process of bringing Marketplace in as a plugin.Your dedication to the success of not only Runway, but also the success of other teams, is such a benefit to our company. Your willingness to pour into my ADEPTs has helped them grow as developers as well.Thank you for all that you do!"
  },
  {
    "date": "March 8, 2021",
    "role": "Sr Consultant",
    "comments": "Karl, Thank you for coming in to Tech Board last month to walk us all through Runway. I know you have a lot on your plate right now, so I want to make sure that you know that you are appreciated. Keep being awesome!"
  },
  {
    "date": "March 5, 2021",
    "role": "Director - Technology Transformation, Architecture Technology Fellow",
    "comments": "You continue to be a great asset and leader in the Dev Exp place, especially as the product line is growing. I'm really enjoying the partnership with you as PTL and me as PO. With each iteration, I feel like we're gaining momentum, velocity, and a better view of the horizon.Thank you for all the #passion, #accountability, and #selfless behavior - from planning activities, engagement with new squad engineers, and making yourself available to all of our customers.Thank you!"
  },
  {
    "date": "March 2, 2021",
    "role": "Associate Developer, IT Applications",
    "comments": "Karl, I appreciate all your help with the Azure service principal access over the past several weeks! The API calls, especially, were very difficult to write and debug--thanks for guiding me through that."
  },
  {
    "date": "March 1, 2021",
    "role": "IT Data Warehousing Manager",
    "comments": "Karl, I just want to thank you for all you do to enable the DEA group move forward on our automation efforts. You are a great technical leader, so patient, and such a good mentor to my team. I'm glad to have you on our squad! #selfless #passionate"
  },
  {
    "date": "Feb 5, 2021",
    "role": "Vice President (VP) Corporate Technology",
    "comments": "I wanted to let you know that I was on a call for a Runway demo and discussion and was very impressed with Karl. He has a great understanding of the platform and the technology of course, but his patience, and willingness to engage and even debate in a very productive and respectful manner was impressive."
  },
  {
    "date": "Jan 18, 2021",
    "role": "Sr Developer, IT Applications",
    "comments": "Thank you for the endless amount of hard work you have contributed to get us up and running on Runway. I have learned a lot and it has been a great experience. I have gained a confidence that there isn't a problem that can't be solved by the Runway team. Great work!"
  },
  {
    "date": "December 22, 2020",
    "role": "Sr. Engineer, IT Middleware",
    "comments": "#passionate #caring Thank you for the support you provide and answering our questions without any delay when ever we need. Highly appreciate for helping us (ITCE team) in setting up the apigee implementation in Runway"
  },
  {
    "date": "December 21, 2020",
    "role": "Sr. IT DevOps Automation Manager",
    "comments": "First of all, thank you for stepping up and take the responsibility to lead the Runways squads. I was expecting you to catch up gradually since you are relatively new to software development, and the amount of work and number of teams involved in Runway is enormous. You know what, I didn't even notice the transition. Two weeks later, I'm looking at a more organized and clean project space and more effective scum meetings. It's not just me, I also heard great feedback from your teammates that they feel their heads are more clear now. #accountable Wonderful job Karl! keep it up."
  },
  {
    "date": "December 11, 2020",
    "role": "Developer, IT Applications",
    "comments": "#passionate Thank you for constant eye on bugs and finding practical solutions. Not to mention all the times you've helped debug vra, scaffold, etc. #selfless Thanks for providing community contributors guidance and 1on1 help when needed. This more than anything is what will make Runway Successful."
  },
  {
    "date": "December 11, 2020",
    "role": "Associate Developer, IT Applications",
    "comments": "Karl, thanks for all your help with the Data Lake Review Page effort over the past few months! You've been great at understanding what my team needs and advising me on how to design new features on Runway. You know the architecture of the Runway system very well. Also, I really appreciate that you are readily available to help me with technical issues when I try to finalize code (e.g. test cases not working, Git problems). I look forward to continuing to work with you on functional access."
  },
  {
    "date": "December 4, 2020",
    "role": "Sr Consultant",
    "comments": "Thanks for everything that you do for the team and for all of AA. I am very glad that I had a chance to work with you this year!"
  },
  {
    "date": "September 30, 2020",
    "role": "Network Security Engineer",
    "comments": "Thanks Karl your work on Project 42 is awesome and that is gonna help us to reduce lot of manual work."
  },
  {
    "date": "September 10, 2020",
    "role": "Sr. IT DevOps Automation Manager",
    "comments": "SELFLESS: Karl has been helping multiple infrastructure teams in their automation and self service journey. He provides training, shares his knowledge to boost the teams to get started on development with Runway. This is on top of his own development commitment. But he never push the other teams away when they need him."
  },
  {
    "date": "July 31, 2020",
    "role": "Network Architect Manager",
    "comments": "I attended the Interact Studio today and the 'Now' Project 42 team presented yielding amazing comments from the audience. I have a belief one of the key items I have learned about amazing leaders...it's not necessarily what they did when they were there. The true testament of a leader is if the leaders principles live on for others to progress when the leader moves on. Great work my friend, 42 Thrives."
  },
  {
    "date": "March 31, 2020",
    "role": "Sr IT Project Manager",
    "comments": "Hi Karl, Always been a fan of yours thinking outside the box! Project42 needs young, energetic and intelligent ones like you! Thanks for working in collaboration with our LCM team and others."
  },
  {
    "date": "March 26, 2020",
    "role": "Network Services Team Lead",
    "comments": "Karl - On behalf of the entire LCM team we would like to thank you for working so diligently on the information we requested. You put a lot of time and effort into this and we all appreciate it more than you know!! Your team work and dedication to collaboration is to be commended. Thank you again!!"
  },
  {
    "date": "March 10, 2020",
    "role": "Network Tools Engineer",
    "comments": "Thank you Karl for assisting with all the Network Tools questions recently. You are a very reliable team mate who is always open to help others. Appreciate your patience and all the help. :)"
  },
  {
    "date": "March 5, 2020",
    "role": "Application Developer",
    "comments": "From the day I started working at AA Karl has been very instrumental in collaborating with me. He thrive on finding better ways to do things and is always available for assistance. he has made my integration at AA very smooth and I would like to take this chance to say thank you and look forward to a continuous collaboration and innovation."
  },
  {
    "date": "November 13, 2019",
    "role": "Chief Information Officer (CIO), Executive Vice President (EVP)",
    "comments": "Terrific work on Project 42 - I loved seeing the progress you've made. This will have a huge impact on how we work and I so appreciate all your hard work. Keep it up - you are making us all better."
  },
  {
    "date": "August 4, 2019",
    "role": "Network Security Manager",
    "comments": "Thank you for taking the time to talk to me about your automation journey and how our teams can collaborate to integrate our tools. Thanks for all you do."
  },
  {
    "date": "July 19, 2019",
    "role": "Vice President (VP) Enterprise Technology Services",
    "comments": "Karl, Great automation demo this week, you rock!"
  },
  {
    "date": "January, 2019",
    "role": "Network Services Manager",
    "comments": "Karl is passionate about what he does and how he does it. His collaborative approach and desire to work with others will enable IT to push together as ONE team. As we continue to move to an Agile and Devops organization, Karl has been a leader to help sharpen our multi-discipline areas such as knocking down roadblocks for the teams. Karls's passion for team is awesome and balancing it in communications with other departments will help drive excellence for us in  2019 across other orgs. Additionally, his caring personality, putting the needs of others first and regard for the each person is very apparent and an awesome strength. Overall, Karl has great momentum and I am looking forward to a productive 2019."
  },
  {
    "date": "January, 2019",
    "role": "Network Architect Manager",
    "comments": "Karl consistently keeps ahead of the curve of developing technologies for his area of expertise, often leading others to solve security related issues with development tools."
  },
  {
    "date": "January, 2019",
    "role": "Network Architect Manager",
    "comments": "Karl's demeanor is one of operational excellence.  Karl regularly solicits feedback from peers on improvements and implements."
  },
  {
    "date": "August 20, 2018",
    "role": "Network Tools Engineer",
    "comments": "Karl is a colleague that every one can dream of to work with. He is one of the few on whom we can rely on anytime, any situation. The best back up I ever got in my experience. He always makes me proud when I come back from vacation by keeping up with work. I can plan my vacations without hesitation and less worried, just because of him. He has added a great deal of automation to our tools which has reduced the daily work load of the entire team. Which in turns helps to reduce manual errors and be more reliable. Thank you Karl!!"
  },
  {
    "date": "August 15, 2018",
    "role": "Network Services Architect",
    "comments": "Karl took it upon himself to develop a platform that would automate common tasks to correctly insource and monitor systems. These task were very time consuming on engineers and administrators. This was not an easy task since there were 5 separate and very different platforms that he needed to code for based on their API capabilities. This new platform will free up several man hours per request and allow adminstrators and engineers to concentrate on more pressing work."
  },
  {
    "date": "June 7, 2018",
    "role": "Sr Network Engineer",
    "comments": "Thank you for consistently bringing value to the company, being open-minded to new ideas, and for all you do to maintain the integrity of the tools."
  },
  {
    "date": "June 1, 2018",
    "role": "Network Tools Engineer",
    "comments": "Thanks for the hard work done on the new ENS portal tool. Its laying the foundation to lots of great tools to come. "
  },
  {
    "date": "April 4, 2018",
    "role": "Sr Datacenter Network Engineer",
    "comments": "Just wanted to say thanks for helping out with troubleshooting some major issues in the DataCenter and taking the time to get me the tools I needed. True team work mentality."
  },
  {
    "date": "December, 2017",
    "role": "Network Services Manager",
    "comments": "Karl has great scripting skills and leverages them to streamline work when applicable. As AA IT continues to drive toward more automation, Karl is the key resource on the Services team to assist in that growth."
  },
  {
    "date": "December, 2017",
    "role": "Network Services Manager",
    "comments": "Karl is an exceptional engineer! He is reliable, delivers quality work on time and takes on any challenge presented. He is dedicated and hard working and has become quite a star among the team! His peers look to him for support and guidance in his areas of expertise. Karl lead the Tools team to success by ensuring the Roadmap was completed and reviewed at a regular cadence. Thank you for all you do Karl!"
  },
  {
    "date": "November 28, 2017",
    "role": "Network Engineering Team Lead",
    "comments": "Thank you Karl for being the professional engineer that you are. I cannot count the number of times you have stopped what you were doing to assist network engineering with showing how to use a specific tools or recommending solutions to problems. You are an example to us all Karl. We look forward to hearing all the great things you will accomplish in the future."
  },
  {
    "date": "June 20, 2017",
    "role": "Network Engineering Manager",
    "comments": "Working as a team for the H3C insourcing your automation solutions for migrating switches from HP(DXC) Managed to AA Managed has enabled the Network Engineering team to achieve the result of migrating 100 switches or more in a change. This type of automation never existed before, thank you for your long days and nights to enable this automation solution for the Airline."
  }
]
